package 환생하기프로젝트발표용.copy;

import java.util.ArrayList;

public class 스토리쓰레드적용 implements Runnable {
	
	ArrayList<String> 문장들 = new ArrayList<String>(); 
	
	public void run() {
		// TODO Auto-generated method stub
		try {
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			문장들.add("○");
			
			문장들.add("○○○○○○      [환생하기 프로젝트]      ○○○○○      [환생하기 프로젝트]       ○○○○○       [환생하기 프로젝트]      ○○○○○○");
			문장들.add("");
			문장들.add("○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○");//●
			문장들.add("○○○                                                                                                                                                                                                                                ○○○");
			문장들.add("○○○○○○○○○○○○○○○○○○○○○○○    환생(점수) 기준표     ○○○○○○○○○○○○○○○○○○○○○○○");//●
			문장들.add("○○○                                                                                                                                                                                                                                ○○○");
			문장들.add("○○○　　　　　　　     || 　 80점 이상 = '인간'  　||  　60점 이상 = '짐승' 　 ||  　60점 미만 '식물'  　||                                      ○○○");//레벨이 오르면서 다음 단계 관문으로 가게된다
			문장들.add("○○○                                                                                                                                                                                                                                ○○○");
			문장들.add("○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○");//●
			문장들.add("○○○○○○○○○○○○○○○○○○○○○○○○      배경 스토리       ○○○○○○○○○○○○○○○○○○○○○○○○");//●
			문장들.add("○○○                                                                                                                                                                                                                                ○○○");
			문장들.add("○○○	                   **당신은 차사(저승변호사)를 선임할 권리가 있으며, 재판을 통해 환생하시길 바랍니다 **                                   ○○○");//게임 스토리 멘트
			문장들.add("○○○                                                                                                                                                                                                                                ○○○");
			문장들.add("○○○                                                                                                                                                                                                                                ○○○");
			문장들.add("○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○"); //○●
			문장들.add("○○○○○○○○○○○○○○○○○○○○○○○○    차사(변호사) 설명     ○○○○○○○○○○○○○○○○○○○○○○○");//●
			문장들.add("○○○                                                                                                                                                                                                                                ○○○");
			문장들.add("○○○　　　　 　　　 ※ 기분파 차사의 특징                                                                                                                        ○○○");
			문장들.add("○○○　　　　 　　　　　 　　　 망자의 추가변호 가능 죄(점수) : 0 ~ 15점 사이                                                                 ○○○");
			문장들.add("○○○　　　　　　　　 　　　 　 망자의 추가변호 가능 죄(횟수) : 3회                                                                                ○○○");
			문장들.add("○○○                                                                                                                                                                                                                                ○○○");
			문장들.add("○○○　　　　　 　　 ※ 소심파 차사의 특징                                                                                                                        ○○○");
			문장들.add("○○○　　　　　　 　　　 　　　 망자의 추가변호 가능 죄(점수) : 0 ~ 05점 사이                                                                ○○○");
			문장들.add("○○○　　　　　　 　　　 　　　 망자의 추가변호 가능 죄(횟수) : 5회                                                                                ○○○");
			문장들.add("○○○                                                                                                                                                                                                                                ○○○");
			문장들.add("○○○　　　　　　 　 ※ 도박파 차사의 특징                                                                                                                        ○○○");
			문장들.add("○○○　　　　　　 　　　 　　　 망자의 추가변호 가능 죄(점수) : -5 ~ 10점 사이                                                               ○○○");
			문장들.add("○○○　　　　　　　 　　 　　　 망자의 추가변호 가능 죄(횟수) : 7회                                                                                ○○○");
			문장들.add("○○○                                                                                                                                                                                                                                ○○○");
			문장들.add("○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○");//●
			문장들.add("○○○");
			문장들.add("※ 추가 변호해줄 지옥저승사자인 차사를 선임하시오. (선택 번복은 없으니, 신중하게 선택하세요.)");
			문장들.add("        (1번)              (2번)              (3번)");
			문장들.add("기분파 차사 / 소심파 차사 / 도박파 차사");
			
			//문장들.addAll();
			for(int i=0; i<57; i++) {
				System.out.print(문장들.get(i));
				Thread.sleep(11);
			}
			System.out.println();
			for(int i=57; i<=문장들.size(); i++) {
				System.out.println(문장들.get(i));
				Thread.sleep(35);
			}
		} catch (Exception e) {
			// TODO: handle exception
		}
	}
	/*@Override
	public void run() {
		// TODO Auto-generated method stub
		문장들.add("");
		for(int i=0; i<문장들.size(); i++) {
			System.out.println(문장들.add("a"));
			try {
				Thread.sleep(100);
			} catch (InterruptedException e) {
				// TODO Auto-generated catch block
				e.printStackTrace();
			}
		}
	}*/
}


