package 환생하기프로젝트발표용.copy;

public class 판관 extends NPC유닛 {

	//[살인]
	String 인턴직질문1_1 = " '망자는 생전에 [살인]죄와 거리가 멀다고 생각합니까?' ";
	String 계약직질문1_2 = " '망자가 짐승을 죽인적이 있습니까?' ";
	String 정규직질문1_3 = " '그래서 잘했다고 생각합니까?' ";
	//[거짓]	
	String 인턴직질문2_1 = " '망자는 생전에 [거짓]죄와 거리가 멀다고 생각합니까?' "; 
	String 계약직질문2_2 = " '생전에 사람의 마음을 훔친적이 있습니까?' ";
	String 정규직질문2_3 = " '그래서 잘했다고 생각합니까?' ";
	//[음탕]
	String 인턴직질문3_1 = " '망자는 생전에 [음란]죄와 거리가 멀다고 생각합니까?' ";
	String 계약직질문3_2 = " '망자는 외도를 한적이 있습니까?' ";
	String 정규직질문3_3 = " '그래서 잘했다고 생각합니까?' ";
	//[나태]
	String 인턴직질문4_1 = " '망자는 생전에 [나태]죄와 거리가 멀다고 생각합니까?' ";
	String 계약직질문4_2 = " '망자는 본인이 작심3일을 반복하던 사람이라고 생각합니까?' ";
	String 정규직질문4_3 = " '그래서 잘했다고 생각합니까?' ";
	//[불의]
	String 인턴직질문5_1 = " '망자는 생전에 [불의]죄와 거리가 멀다고 생각합니까?' ";
	String 계약직질문5_2 = " '망자는 물질적인 기부를 행하였습니까?' ";
	String 정규직질문5_3 = " '그래서 잘했다고 생각합니까?' ";
	//[배신]				
	String 인턴직질문6_1 = " '망자는 생전에 [배신]죄와 거리가 멀다고 생각합니까?' ";
	String 계약직질문6_2 = " '망자는 이득을 위해 자신의 의견을 관철하는 편 입니까?' ";
	String 정규직질문6_3 = " '그래서 잘했다고 생각합니까?' ";
	//[폭력]						
	String 인턴직질문7_1 = " '망자는 생전에 [폭력]죄와 거리가 멀다고 생각합니까?' ";
	String 계약직질문7_2 = " '망자는 사람이나 짐승에게 폭력을 가한적이 있습니까?' ";
	String 정규직질문7_3 = " '그래서 잘했다고 생각합니까?' ";
	//[천륜]
}
